class Privacy {

  static const String privacyMarkdownString = """
# 懒猫打卡隐私政策

最后更新时间：2024 年 4 月 17 日

本隐私政策描述了我们在您使用服务时收集、使用和披露您的信息的政策和程序，并告诉您您的隐私权以及法律如何保护您。

我们使用您的个人数据来提供和改进服务。使用服务即表示您同意根据本隐私政策收集和使用信息。

## 解释和定义

### 解释

黑体部分具有在以下条件下定义的含义。

### 定义

就本隐私政策而言：

*   **帐户**是指为您访问我们的服务或部分服务而创建的唯一帐户。
*   **关联公司**是指控制一方、受一方控制或与一方共同控制的实体，其中“控制”是指拥有 50% 或以上有权投票选举董事或其他管理机构的股份、股权或其他证券。
*   **应用程序**是指本公司提供的软件程序“懒猫打卡”。
*   **公司**（在本协议中称为“公司”、“我们”、“我们”或“我们的”）指懒猫打卡。
*   **国家**指：中国
*   **设备**是指可以访问服务的任何设备，例如计算机、手机或数字平板电脑。
*   **个人数据**是与已识别或可识别的个人相关的任何信息。
*   **服务**指的是应用程序。
*   **服务提供商**是指代表公司处理数据的任何自然人或法人。是指本公司雇用的为促进本服务、代表本公司提供本服务、执行与本服务相关的服务或协助本公司分析本服务的使用方式的第三方公司或个人。
*   **使用数据**是指自动收集的数据，可以是通过使用服务生成的，也可以是从服务基础设施本身生成的（例如，页面访问的持续时间）。
*   **您**是指访问或使用服务的个人，或者代表该个人访问或使用服务的公司或其他法律实体（如果适用）。

## 收集和使用您的个人数据

### 收集的数据类型

#### 个人资料

在使用我们的服务时，我们可能会要求您向我们提供某些可用于联系或识别您的个人身份信息。个人身份信息可能包括但不限于：

*   电子邮件地址

#### 电子邮件地址

在您向我们通过邮件反馈问题和改善时我们可能通过您的电子邮件地址与您取得联系。但我们不会收集并记录您的信息，仅作为沟通使用。

### 您的个人数据的使用

公司可能将个人数据用于以下目的：

*   **提供和维护我们的服务**，包括监控我们服务的使用情况。
*   \*\*为了履行合同：\*\*您所购买的产品、物品或服务的购买合同或通过服务与我们签订的任何其他合同的制定、遵守和承诺。
*   \*\*与您联系：\*\*通过电子邮件或其他同等形式的电子通信方式与您联系，例如移动应用程序的有关更新的推送通知或与功能、产品或合同服务（包括安全更新）相关的信息通信，在必要或合理的情况下实施。
*   **向您提供**与您已购买或查询的产品、服务和活动类似的我们提供的其他商品、服务和活动的新闻、特别优惠和一般信息，除非您选择不接收此类信息。
*   \*\*管理您的请求：\*\*出席并管理您向我们提出的请求。
*   \*\*对于业务转让：\*\*我们可能会使用您的信息来评估或进行合并、剥离、重组、改组、解散或以其他方式出售或转让我们的部分或全部资产，无论是作为持续经营企业还是作为破产、清算、或类似程序，其中我们持有的有关我们服务用户的个人数据属于转让的资产。
*   **出于其他目的**：我们可能会将您的信息用于其他目的，例如数据分析、识别使用趋势、确定我们促销活动的有效性以及评估和改进我们的服务、产品、服务、营销和您的体验。

我们可能在以下情况下共享您的个人信息：

*   \*\*与服务提供商：\*\*我们可能会与服务提供商共享您的个人信息，以监控和分析我们服务的使用情况，并与您联系。
*   \*\*对于业务转让：\*\*我们可能会在与其他公司合并、出售公司资产、融资或收购我们全部或部分业务时或在谈判期间共享或转让您的个人信息。
*   \*\*与关联公司：\*\*我们可能会与我们的关联公司共享您的信息，在这种情况下，我们将要求这些关联公司遵守本隐私政策。关联公司包括我们的母公司以及我们控制或与我们共同控制的任何其他子公司、合资伙伴或其他公司。
*   \*\*与业务合作伙伴：\*\*我们可能会与我们的业务合作伙伴共享您的信息，以便为您提供某些产品、服务或促销活动。
*   \*\*与其他用户：\*\*当您与其他用户共享个人信息或以其他方式在公共区域互动时，此类信息可能会被所有用户查看，并可能会在外部公开分发。

### 保留您的个人数据

公司将仅在本隐私政策中规定的目的所需的时间内保留您的个人数据。我们将在遵守我们的法律义务（例如，如果我们需要保留您的数据以遵守适用法律）、解决争议以及执行我们的法律协议和政策所需的范围内保留和使用您的个人数据。

公司还将保留使用数据用于内部分析目的。使用数据通常会保留较短的时间，除非该数据用于加强安全性或改进我们服务的功能，或者我们有法律义务保留较长时间的数据。

### 您的个人数据的转移

您的信息（包括个人数据）将在公司的运营办公室以及参与处理的各方所在的任何其他地方进行处理。这意味着该信息可能会传输到并保存在位于您所在州、省、国家或其他政府管辖区之外的计算机上，这些地方的数据保护法可能与您所在管辖区的数据保护法不同。

您同意本隐私政策并随后提交此类信息，即表示您同意该转让。

公司将采取一切合理必要的措施，确保您的数据得到安全处理并符合本隐私政策，并且不会将您的个人数据传输到任何组织或国家，除非有足够的控制措施，包括确保数据的安全性。您的数据和其他个人信息。

### 删除您的个人数据

您有权删除或要求我们协助删除我们收集的有关您的个人数据。

我们的服务可能使您能够从服务中删除有关您的某些信息。

您可以随时更新、修改或删除您的信息，只需登录您的帐户（如果有的话），然后访问允许您管理您的个人信息的帐户设置部分。您还可以联系我们，请求访问、更正或删除您向我们提供的任何个人信息。

但请注意，当我们有法律义务或合法依据时，我们可能需要保留某些信息。

### 披露您的个人数据

#### 商业交易

如果公司涉及合并、收购或资产出售，您的个人数据可能会被转移。我们将在您的个人数据被转移并受不同隐私政策约束之前发出通知。

#### 执法

在某些情况下，如果法律要求或响应公共机构（例如法院或政府机构）的有效要求，公司可能需要披露您的个人数据。

#### 其他法律要求

公司可能会善意地披露您的个人数据，并相信此类行动对于以下目的是必要的：

*   遵守法律义务
*   保护和捍卫公司的权利或财产
*   防止或调查与服务相关的可能的不当行为
*   保护服务用户或公众的人身安全
*   避免承担法律责任

### 您的个人数据的安全

您的个人数据的安全对我们很重要，但请记住，没有任何一种互联网传输方法或电子存储方法是 100% 安全的。虽然我们努力使用商业上可接受的方式来保护您的个人数据，但我们不能保证其绝对安全。

## 儿童隐私

我们的服务不针对 13 岁以下的任何人。我们不会故意收集 13 岁以下任何人的个人身份信息。如果您是父母或监护人，并且您知道您的孩子已向我们提供个人数据，请联系我们。如果我们发现我们在未经父母同意的情况下收集了 13 岁以下任何人的个人数据，我们将采取措施从我们的服务器中删除该信息。

如果我们需要依赖同意作为处理您的信息的法律依据，并且您所在的国家/地区需要父母的同意，我们可能会在收集和使用该信息之前要求您父母的同意。

## 其他网站的链接

我们的服务可能包含指向非我们运营的其他网站的链接。如果您点击第三方链接，您将被定向到该第三方的网站。我们强烈建议您查看您访问的每个网站的隐私政策。

我们无法控制任何第三方网站或服务的内容、隐私政策或做法，也不承担任何责任。

## 本隐私政策的变更

我们可能会不时更新我们的隐私政策。我们将通过在此页面上发布新的隐私政策来通知您任何更改。

在更改生效之前，我们将通过电子邮件和/或我们服务上的显着通知告知您，并更新本隐私政策顶部的“最后更新”日期。

建议您定期查看本隐私政策以了解任何变更。本隐私政策的更改在发布到本页面后即生效。

## 联系我们

如果您对本隐私政策有任何疑问，您可以联系我们：

*   [知乎](https://www.zhihu.com/)
*   [微博](https://weibo.com/)
*   [小红书](https://www.xiaohongshu.com/)

""";
}
