class Privacy {
  Privacy._();
  static const String privacyMarkdownString = """
# 懒猫打卡隐私政策


最后更新时间：2024 年 4 月 17 日

本隐私政策描述了我们在您使用服务时收集、使用和披露您的信息的政策和程序，并告诉您您的隐私权以及法律如何保护您。

我们使用您的个人数据来提供和改进服务。使用服务即表示您同意根据本隐私政策收集和使用信息。

## 解释和定义

### 解释

黑体部分具有在以下条件下定义的含义。

### 定义

就本隐私政策而言：

*   **帐户**是指为您访问我们的服务或部分服务而创建的唯一帐户。
*   **关联公司**是指控制一方、受一方控制或与一方共同控制的实体，其中“控制”是指拥有 50% 或以上有权投票选举董事或其他管理机构的股份、股权或其他证券。
*   **应用程序**是指本公司提供的软件程序“懒猫打卡”。
*   **公司**（在本协议中称为“公司”、“我们”、“我们”或“我们的”）指懒猫打卡。
*   **国家**指：中国
*   **设备**是指可以访问服务的任何设备，例如计算机、手机或数字平板电脑。
*   **个人数据**是与已识别或可识别的个人相关的任何信息。
*   **服务**指的是应用程序。
*   **服务提供商**是指代表公司处理数据的任何自然人或法人。是指本公司雇用的为促进本服务、代表本公司提供本服务、执行与本服务相关的服务或协助本公司分析本服务的使用方式的第三方公司或个人。
*   **使用数据**是指自动收集的数据，可以是通过使用服务生成的，也可以是从服务基础设施本身生成的（例如，页面访问的持续时间）。
*   **您**是指访问或使用服务的个人，或者代表该个人访问或使用服务的公司或其他法律实体（如果适用）。

## 收集和使用您的个人数据

### 收集的数据类型

#### 个人资料

在使用我们的服务时，我们可能会要求您向我们提供某些可用于联系或识别您的个人身份信息。个人身份信息可能包括但不限于：

*   电子邮件地址

#### 电子邮件地址

在您向我们通过邮件反馈问题和改善时我们可能通过您的电子邮件地址与您取得联系。但我们不会收集并记录您的信息，仅作为沟通使用。

### 您的个人数据的使用

公司可能将个人数据用于以下目的：

*   **提供和维护我们的服务**：包括监控我们服务的使用情况。
*   **为了履行合同**：您所购买的产品、物品或服务的购买合同或通过服务与我们签订的任何其他合同的制定、遵守和承诺。
*   **与您联系**：通过电子邮件或其他同等形式的电子通信方式与您联系，例如移动应用程序的有关更新的推送通知或与功能、产品或合同服务（包括安全更新）相关的信息通信，在必要或合理的情况下实施。
*   **向您提供**：与您已购买或查询的产品、服务和活动类似的我们提供的其他商品、服务和活动的新闻、特别优惠和一般信息，除非您选择不接收此类信息。
*   **管理您的请求**：出席并管理您向我们提出的请求。
*   **对于业务转让**：我们可能会使用您的信息来评估或进行合并、剥离、重组、改组、解散或以其他方式出售或转让我们的部分或全部资产，无论是作为持续经营企业还是作为破产、清算、或类似程序，其中我们持有的有关我们服务用户的个人数据属于转让的资产。
*   **出于其他目的**：我们可能会将您的信息用于其他目的，例如数据分析、识别使用趋势、确定我们促销活动的有效性以及评估和改进我们的服务、产品、服务、营销和您的体验。

我们可能在以下情况下共享您的个人信息：

*   **与服务提供商**：我们可能会与服务提供商共享您的个人信息，以监控和分析我们服务的使用情况，并与您联系。
*   **对于业务转让**：我们可能会在与其他公司合并、出售公司资产、融资或收购我们全部或部分业务时或在谈判期间共享或转让您的个人信息。
*   **与关联公司**：我们可能会与我们的关联公司共享您的信息，在这种情况下，我们将要求这些关联公司遵守本隐私政策。关联公司包括我们的母公司以及我们控制或与我们共同控制的任何其他子公司、合资伙伴或其他公司。
*   **与业务合作伙伴**：我们可能会与我们的业务合作伙伴共享您的信息，以便为您提供某些产品、服务或促销活动。
*   **与其他用户**：当您与其他用户共享个人信息或以其他方式在公共区域互动时，此类信息可能会被所有用户查看，并可能会在外部公开分发。

### 保留您的个人数据

公司将仅在本隐私政策中规定的目的所需的时间内保留您的个人数据。我们将在遵守我们的法律义务（例如，如果我们需要保留您的数据以遵守适用法律）、解决争议以及执行我们的法律协议和政策所需的范围内保留和使用您的个人数据。

公司还将保留使用数据用于内部分析目的。使用数据通常会保留较短的时间，除非该数据用于加强安全性或改进我们服务的功能，或者我们有法律义务保留较长时间的数据。

### 您的个人数据的转移

您的信息（包括个人数据）将在公司的运营办公室以及参与处理的各方所在的任何其他地方进行处理。这意味着该信息可能会传输到并保存在位于您所在州、省、国家或其他政府管辖区之外的计算机上，这些地方的数据保护法可能与您所在管辖区的数据保护法不同。

您同意本隐私政策并随后提交此类信息，即表示您同意该转让。

公司将采取一切合理必要的措施，确保您的数据得到安全处理并符合本隐私政策，并且不会将您的个人数据传输到任何组织或国家，除非有足够的控制措施，包括确保数据的安全性。您的数据和其他个人信息。

### 删除您的个人数据

您有权删除或要求我们协助删除我们收集的有关您的个人数据。

我们的服务可能使您能够从服务中删除有关您的某些信息。

您可以随时更新、修改或删除您的信息，只需登录您的帐户（如果有的话），然后访问允许您管理您的个人信息的帐户设置部分。您还可以联系我们，请求访问、更正或删除您向我们提供的任何个人信息。

但请注意，当我们有法律义务或合法依据时，我们可能需要保留某些信息。

### 披露您的个人数据

#### 商业交易

如果公司涉及合并、收购或资产出售，您的个人数据可能会被转移。我们将在您的个人数据被转移并受不同隐私政策约束之前发出通知。

#### 执法

在某些情况下，如果法律要求或响应公共机构（例如法院或政府机构）的有效要求，公司可能需要披露您的个人数据。

#### 其他法律要求

公司可能会善意地披露您的个人数据，并相信此类行动对于以下目的是必要的：

*   遵守法律义务
*   保护和捍卫公司的权利或财产
*   防止或调查与服务相关的可能的不当行为
*   保护服务用户或公众的人身安全
*   避免承担法律责任

### 您的个人数据的安全

您的个人数据的安全对我们很重要，但请记住，没有任何一种互联网传输方法或电子存储方法是 100% 安全的。虽然我们努力使用商业上可接受的方式来保护您的个人数据，但我们不能保证其绝对安全。

## 儿童隐私

我们的服务不针对 13 岁以下的任何人。我们不会故意收集 13 岁以下任何人的个人身份信息。如果您是父母或监护人，并且您知道您的孩子已向我们提供个人数据，请联系我们。如果我们发现我们在未经父母同意的情况下收集了 13 岁以下任何人的个人数据，我们将采取措施从我们的服务器中删除该信息。

如果我们需要依赖同意作为处理您的信息的法律依据，并且您所在的国家/地区需要父母的同意，我们可能会在收集和使用该信息之前要求您父母的同意。

## 其他网站的链接

我们的服务可能包含指向非我们运营的其他网站的链接。如果您点击第三方链接，您将被定向到该第三方的网站。我们强烈建议您查看您访问的每个网站的隐私政策。

我们无法控制任何第三方网站或服务的内容、隐私政策或做法，也不承担任何责任。

## 本隐私政策的变更

我们可能会不时更新我们的隐私政策。我们将通过在此页面上发布新的隐私政策来通知您任何更改。

在更改生效之前，我们将通过电子邮件和/或我们服务上的显着通知告知您，并更新本隐私政策顶部的“最后更新”日期。

建议您定期查看本隐私政策以了解任何变更。本隐私政策的更改在发布到本页面后即生效。

## 联系我们

如果您对本隐私政策有任何疑问，您可以联系我们：

*   [知乎](https://www.zhihu.com/)
*   [微博](https://weibo.com/)
*   [小红书](https://www.xiaohongshu.com/)

""";
  static const String termsMarkdownString = """
# 懒猫打卡用户使用条款

最后更新时间：2024 年 4 月 20 日

在使用我们的服务之前，请仔细阅读这些条款和条件。

## 解释和定义

### 解释

黑体单词具有在以下条件下定义的含义。

### 定义

就这些条款和条件而言：

*   **应用程序**是指您在任何电子设备上下载的本公司提供的软件程序，名称为懒猫打卡
*   **应用程序商店**是指由 Apple Inc. (Apple App Store) 或 Google Inc. (Google Play Store) 运营和开发的数字分发服务，可在其中下载应用程序。
*   **关联公司**是指控制一方、受一方控制或与一方共同控制的实体，其中“控制”是指拥有 50% 或以上有权投票选举董事或其他管理机构的股份、股权或其他证券。
*   **国家**指：中国
*   **公司**（在本协议中称为“公司”、“我们”、“我们”或“我们的”）指懒猫打卡。
*   **设备**是指可以访问服务的任何设备，例如计算机、手机或数字平板电脑。
*   **服务**指的是应用程序。
*   **条款和条件**（也称为“条款”）是指构成您与公司之间有关使用服务的完整协议的这些条款和条件。。
*   **第三方社交媒体服务**是指第三方提供的、可能由服务显示、包含或提供的任何服务或内容（包括数据、信息、产品或服务）。
*   **您**是指访问或使用服务的个人，或者代表该个人访问或使用服务的公司或其他法律实体（如果适用）。

## 致谢

这些是管理本服务使用的条款和条件以及您与公司之间签订的协议。这些条款和条件规定了所有用户在使用服务方面的权利和义务。

您访问和使用服务的条件是您接受并遵守这些条款和条件。这些条款和条件适用于所有访问者、用户和访问或使用服务的其他人。

通过访问或使用服务，您同意受这些条款和条件的约束。如果您不同意这些条款和条件的任何部分，则您不得访问该服务。

您声明您已年满 18 岁。公司不允许 18 岁以下的人士使用本服务。

您访问和使用本服务的前提是您接受并遵守公司的隐私政策。我们的隐私政策描述了我们在您使用应用程序或网站时收集、使用和披露您的个人信息的政策和程序，并告诉您您的隐私权以及法律如何保护您。在使用我们的服务之前，请仔细阅读我们的隐私政策。

## 其他网站的链接

我们的服务可能包含非公司拥有或控制的第三方网站或服务的链接。

公司无法控制任何第三方网站或服务的内容、隐私政策或做法，也不承担任何责任。您进一步承认并同意，对于因使用或依赖任何此类内容、商品或服务而造成或声称造成的任何损害或损失，公司不承担直接或间接的责任。或通过任何此类网站或服务。

我们强烈建议您阅读您访问的任何第三方网站或服务的条款和条件以及隐私政策。

## 终止

我们可以出于任何原因（包括但不限于您违反这些条款和条件）立即终止或暂停您的访问，恕不另行通知或承担责任。

终止后，您使用服务的权利将立即终止。

## 责任限制

尽管您可能遭受任何损害，公司及其任何供应商根据本条款的任何规定承担的全部责任以及您对上述所有内容的唯一补救措施应仅限于您通过服务实际支付的金额或 100 美元如果您尚未通过本服务购买任何东西。

在适用法律允许的最大范围内，在任何情况下，公司或其供应商均不对任何特殊、偶然、间接或后果性损害（包括但不限于利润损失、数据丢失或其他信息，用于因使用或无法使用服务、与服务一起使用的第三方软件和/或第三方硬件而引起或以任何方式与之相关的业务中断、人身伤害、隐私损失，或与本条款任何规定相关的其他情况），即使公司或任何供应商已被告知发生此类损害的可能性，即使补救措施未能达到其基本目的。

某些州不允许排除默示保证或偶发或间接损害的责任限制，这意味着上述某些限制可能不适用。在这些州，各方的责任将受到法律允许的最大范围的限制。

## “按现状”和“按可用”免责声明

本服务按“原样”和“现有”向您提供，且包含所有故障和缺陷，不提供任何形式的保证。在适用法律允许的最大范围内，公司代表其自身、其关联公司及其各自的许可方和服务提供商，明确否认与服务，包括适销性、特定用途适用性、所有权和不侵权的所有默示保证，以及交易过程、履行过程、使用或贸易实践中可能产生的保证。在不限于前述规定的情况下，公司不提供任何保证或承诺，也不以任何形式表示服务将满足您的要求、实现任何预期结果、与任何其他软件、应用程序、系统或服务兼容或协同工作、运行不间断，满足任何性能或可靠性标准，或者没有错误，或者任何错误或缺陷可以或将被纠正。

在不限制前述规定的情况下，公司或公司的任何提供商均不做出任何形式的明示或暗示的陈述或保证：(i) 关于服务或信息、内容和材料或产品的操作或可用性包括在其中； (ii) 服务不会中断或没有错误； (iii) 通过服务提供的任何信息或内容的准确性、可靠性或时效性； (iv) 本服务、其服务器、内容或由公司或代表公司发送的电子邮件不存在病毒、脚本、特洛伊木马、蠕虫、恶意软件、定时炸弹或其他有害组件。

某些司法管辖区不允许排除某些类型的保证或对消费者适用法定权利的限制，因此上述部分或全部排除和限制可能不适用于您。但在这种情况下，本节规定的排除和限制应在适用法律可强制执行的最大范围内适用。

## 适用法律

本条款以及您对服务的使用应受国家/地区法律（不包括法律冲突规则）管辖。您对应用程序的使用还可能受到其他地方、州、国家或国际法律的约束。

## 争议解决

如果您对服务有任何疑虑或争议，您同意首先尝试通过联系公司以非正式方式解决争议。

## 对于欧盟 (EU) 用户

如果您是欧盟消费者，您将受益于您所居住国家法律的任何强制性规定。

## 美国法律合规性

您声明并保证 (i) 您所在的国家/地区不受美国政府禁运，或已被美国政府指定为“支持恐怖主义”的国家/地区，并且 (ii) 您不位于被列入任何美国政府禁止或限制方名单。

## 可分割性和弃权

### 可分割性

如果这些条款的任何规定被认为不可执行或无效，则该规定将被更改和解释，以根据适用法律最大程度地实现该规定的目标，并且其余规定将继续完全有效。

### 放弃

除本条款另有规定外，未能行使本条款项下的权利或要求履行义务，不应影响一方在此后任何时间行使此类权利或要求履行此类权利的能力，放弃违约行为也不构成放弃任何后续违规行为。

## 翻译 口译

如果我们已通过我们的服务向您提供这些条款和条件，则这些条款和条件可能已翻译。您同意如有争议，以简体中文原文为准。

## 这些条款和条件的变更

我们保留自行决定随时修改或替换这些条款的权利。如果修订内容重大，我们将尽合理努力，在任何新条款生效之前至少提前 30 天发出通知。什么构成重大变更将由我们自行决定。

在这些修订生效后继续访问或使用我们的服务，即表示您同意受修订条款的约束。如果您不同意全部或部分新条款，请停止使用本网站和服务。

## 联系我们

如果您对这些条款和条件有任何疑问，您可以联系我们：

*   通过电子邮件：[feedback@example.com]()
*   访问我们的网站：<https://example.com>


""";
}
